In [39]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [40]:
import pandas as pd
import numpy as np

In [41]:
df = pd.DataFrame(np.arange(1, 13, 1).reshape((3, 4)),
                 index = ['Ohio', 'Colorado', 'New York'],
                 columns = ['One', 'Two', 'Three', 'Four']
                 )
df

          One  Two  Three  Four
Ohio        1    2      3     4
Colorado    5    6      7     8
New York    9   10     11    12

In [42]:
transform_fn = lambda x: x[:4].upper()
transform_fn

In [43]:
indexes = df.index
indexes

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [44]:
renamed_indexes = indexes.map(transform_fn)
renamed_indexes

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [45]:
df.index = renamed_indexes
df

      One  Two  Three  Four
OHIO    1    2      3     4
COLO    5    6      7     8
NEW     9   10     11    12